
NL = "\n"
W_TYPE = "固有名詞"
DELIM = "\t"

HANGEUL_VOWEL = [
    "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"
]

VOWEL_RR = ["a", "ae", "ya", "yae", "eo", "e", "yeo", "ye", "o", "wa", "wae", "oe", "yo", "u", "wo", "we", "wi", "yu",
            "eu", "ui", "i"]

CONSONANT_RR = ["g", "kk", "n", "d", "tt", "r", "m", "b", "pp", "s", "ss", "", "j", "jj", "ch", "k", "t", "p", "h"]
HANGEUL_CONSONANT = [
    "ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
]

BATCHIM_WOV_RR = ["", "k", "k", "kt", "n", "nt", "nh", "t", "l", "lk", "lm", "lp", "lt", "lt", "lp", "lh", "m", "p",
                  "pt", "t", "t", "ng", "t", "t", "k", "t", "p", "h"]
BATCHIM_WV_RR = ["", "g", "kk", "ks", "n", "nj", "nh", "d", "r", "lg", "lm", "lb", "ls", "lt", "lp", "lh", "m", "b",
                 "ps", "s", "ss", "ng", "j", "ch", "k", "t", "p", "h"]
HANGEUL_BATCHIM = [
    [""], ["ᆨ", "ᄀ"], ["ᆩ", "ᄁ"], ["ᆪ"], ["ᆫ", "ᄂ"], ["ᆬ", "ᅜ"], ["ᆭ", "ᅝ"], ["ᆮ", "ᄃ"], ["ᆯ", "ᄅ"], ["ᆰ"], ["ᆱ"],
    ["ᆲ"], ["ᆳ"],
    ["ᆴ"], ["ᆵ"], ["ᆶ", "ᄚ"], ["ᆷ", "ᄆ"], ["ᆸ", "ᄇ"], ["ᆹ", "ᄡ"], ["ᆺ", "ᄉ"], ["ᆻ", "ᄊ"], ["ᆼ", "ᄋ"], ["ᆽ", "ᄌ"],
    ["ᆾ", "ᄎ"],
    ["ᆿ", "ᄏ"], ["ᇀ", "ᄐ"], ["ᇁ", "ᄑ"], ["ᇂ", "ᄒ"]
]

